###############################################################
# ~/.Brewfile - Software Installs for MacOS                   #
#                                                             #
# List of packages to be installed / updated via Homebrew     #
# Apps are sorted by category, and arranged alphabetically    #
# Be sure to delete / comment out anything you do not need    #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile   #
# Source GH repository: https://github.com/edheltzel/Brewfile #
# See brew docs for more info: https://docs.brew.sh/Manpage   #
#                                                             #
# 1. Command Line                                             #
# 2. Software Dev                                             #
# 3. Desktop Apps                                             #
# 4. MacOS Specific Stuff                                     #
#                                                             #
###############################################################

# Options
cask_args appdir: '/Applications', require_sha: true

# Taps
tap 'buo/cask-upgrade' # Upgrade casks
tap 'clementtsang/bottom' # Resource monitor (better top) - Rust
tap 'eddieantonio/eddieantonio' #
tap 'github/gh' # Interact with GitHub PRs, issues, repos
tap 'teamookla/speedtest'   # Command line speed test utility

#############################################################
# 1. Command Line                                           #
#############################################################
brew 'fish'                                 # My Default Shell
brew 'starship'                             # Cross-shell prompt - Rust

# zsh plugins
brew 'zsh-syntax-highlighting'             # Syntax highlighting for zsh
brew 'zsh-autopair'                        # Auto-pairing for zsh
brew 'olets/tap/zsh-abbr'                  # Abbreviations for zsh

# CLI Essentials
brew 'git'          # Version control
brew 'git-extras'   # Extra git commands
brew 'neovim'       # Text editor
brew 'stow'         # Dotfile manager
brew 'topgrade'     # Upgrade all the things - Rust
brew 'zellij'       # Terminal multiplexer (tmux replacement) - Rust

# CLI Basics
brew 'ack'          # Search tool like grep, but faster
brew 'bat'          # Output highlighting (better cat) - Rust
brew 'brew-cask-completion' # Fish shell completion for brew cask
brew 'broot'       # File tree explorer (better tree) - Rust
brew 'chafa'       # Image to ASCII art converter
brew 'coreutils'    # GNU core utilities (those that come with macOS are outdated)
brew 'duti'         # Set default apps for file types
brew 'eza'          # Listing files with info (better ls) replaces exa - Rust
brew 'fd'           # Find files - Rust
brew 'fzf'          # Fuzzy file finder and filtering - Go
brew 'grc'          # Colorize terminal output
brew 'hexyl'        # Hex viewer - Rust
brew 'jq'           # JSON parser, output and query files
brew 'mas'          # Mac App Store CLI
brew 'most'         # Multi-window scroll pager (better less)
brew 'ripgrep'      # Searching within files (better grep) - Rust
brew 'rsync'        # Fast incremental file transfer
brew 'sd'           # RegEx find and replace (better sed) - Rust

# CLI Image Processing and Compression
brew 'unrar'              # Unpack .rar files
brew 'gdk-pixbuf'         # Image loading library
brew 'graphicsmagick'     # Image manipulation
brew 'imagemagick'        # Image manipulation
brew 'jpegoptim'          # JPEG image compression
brew 'mozjpeg'            # JPEG image compression
brew 'optipng'            # PNG image compression
brew 'pango'              # Text layout and rendering

# CLI Monitoring and Performance Apps
brew 'htop'         # Process viewer
brew 'bmon'         # Bandwidth utilization monitor
brew 'bottom'       # Resource monitor (better top) - Rust
brew 'ctop'         # Docker Container metrics and monitoring - Go
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'procs'        # Advanced process viewer (better ps) - Rust

# CLI Productivity Apps
brew 'rclone'       # Manage cloud storage
# brew 'kondo'        # Clean up old files and directories - Rust

# CLI Development Suits
# brew 'lazydocker'   # Full Docker management app - Go
# brew 'gitui'        # A replacement for lazygit - Full Git management app - Rust

# CLI Docs and Cheatsheets
brew 'tealdeer'     # Read cheat sheets (better tldr) - Rust

# CLI Misc
brew 'figlet'       # Output text as big ASCII art text
brew 'neofetch'     # Show system data and ditstro info
#############################################################
# 2. Software / Web Development                             #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew 'python3'                # Python 3

brew 'rust'                   # Rust language
brew 'rustup-init'            # Rust version manager

# Development Utils

brew 'git-lfs'            # Git Large File Storage
brew 'gitkraken'          # Git client GUI
brew 'gitkraken-cli'      # GitKraken CLI

brew 'tig'                # Text-mode interface for git
brew 'watchexec'          # Watch a directory and execute a command when files change


# Security Utilities
brew 'gnupg'             # GNU Privacy Guard
brew 'openssl'           # Cryptography and SSL/TLS Toolkit
brew 'ssh-copy-id'       # Copy SSH keys to remote hosts
cask 'gpg-suite'         # GPG encryption files

#############################################################
# 3. Desktop Applications                                   #
#############################################################


# Media
brew 'webp'                 # WebP image format

# Personal Applications
cask 'obsidian'             # Note taking app

# Utility Applications
cask 'namechanger'          # Rename files in bulk
cask 'onyx'                 # System maintenance

# Browsers
cask 'brave-browser'         # Brave browser - Primary
# cask 'google-chrome'             # Chrome browser

# Fonts
cask 'font-cascadia-code-nf'          # Dev/Terminal Font
cask 'font-fira-code-nerd-font'       # Dev Font
cask 'font-inter'                     # Design font
cask 'font-geist'                     # Design font

# Development Apps
cask 'alacritty'                      # GPU accelerated terminal - Rust
cask 'cyberduck'                      # Mount remote storage locations
cask 'devtoys'                        # Dev tools/utilities for Mac
cask 'diffmerge'                      # File comparison tool
cask 'gitkraken'                      # Git client GUI
cask 'iterm2'                         # Better terminalemulator
cask 'visual-studio-code'             # Code editor - Default

#############################################################
# 4. MacOS Specific Stuff                                   #
#############################################################

# Mac OS Quick-Look Plugins
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'quicklook-json', args: { require_sha: false } # QL for JSON, with trees
cask 'webpquicklook',  args: { require_sha: false } # QL for WebP image files

# Mac OS Mods, Imrovments, & Utilities
cask 'alt-tab'            # Windows like alt-tab
brew 'm-cli'              # All in one MacOS management CLI app: m help
cask 'hiddenbar'          # Hide / show annoying menubar icons
cask 'keka'               # File archiver and extractor

# Mac App Store Installs
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
mas 'WhatsApp', id: 1147396723
mas 'Bitwarden', id: 1352778147
